Cerberus-Robotica/Robot_STM32F4/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <math.h>
#include <stdio.h>
#include <string.h>
#include <inttypes.h>
#include "NRF24.h"
#include "NRF24_reg_addresses.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
#define FLASH_USER_SECTOR      FLASH_SECTOR_7
#define FLASH_USER_START_ADDR  0x08060000UL  // setor reservado

#pragma pack(push, 1)
typedef struct {
    uint8_t id;
    float Vx, Vy, Vang;
    uint8_t kicker;
    uint8_t config;
    uint8_t param;
} Pacote;
#pragma pack(pop)

typedef struct {
    uint8_t id;          // ID do robô
} Info;

Info info;

volatile uint8_t id = -1;
volatile float vx = 0;
volatile float vy = 0;
volatile float vang = 0;
volatile uint8_t kicker = 0;
volatile uint8_t config = 0;
volatile uint8_t param = 0;


uint8_t addr[5] = {'C', 'E', 'R', 'B', 'R'};
uint8_t channel = 83;
uint8_t pld_size = sizeof(Pacote);
volatile uint8_t radio_timeout = 0;


const uint32_t ARR = 1000;
const float R = 0.0915;
const float Rr = 0.02;
const float velocidade_maxima_motor = 29.32153; // rads/segundo de 280rmp
const float velocidade_minima_motor = 0.6*velocidade_maxima_motor;
const float epsilon = 2;
const float a1 = 0.785398;   // 45°
const float a2 = 2.35619;  // 135°
const float a3 = 3.92699; // 225°
const float a4 = 5.49779;  // 315°

//Variaveis do Softstart
float duty_cycle[4];
float duty_cycle_atual[4] = {0, 0, 0, 0}; // PWM atual de cada motor
uint32_t ultimaAtualizacao = 0;
const uint32_t intervalo_ms = 20;  // Atualização a cada 20ms (~50Hz)
const float passo_pwm = 3.0f;      // Incremento por atualização



/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define PWM_MOTOR1_CHANNEL TIM_CHANNEL_1
#define PWM_MOTOR1_TIMER &htim1

#define PWM_MOTOR2_CHANNEL TIM_CHANNEL_2
#define PWM_MOTOR2_TIMER &htim3

#define PWM_MOTOR3_CHANNEL TIM_CHANNEL_1
#define PWM_MOTOR3_TIMER &htim3

#define PWM_MOTOR4_CHANNEL TIM_CHANNEL_1
#define PWM_MOTOR4_TIMER &htim2

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */


/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim11;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM11_Init(void);
static void MX_TIM3_Init(void);
static void MX_I2C1_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void radio_setup() {
	  ce_high();
	  HAL_Delay(5);
	  ce_low();

	  nrf24_init();

	  nrf24_auto_ack_all(auto_ack);
	  nrf24_en_ack_pld(disable);
	  nrf24_dpl(disable);

	  nrf24_tx_pwr(_0dbm);
	  nrf24_data_rate(_2mbps);
	  nrf24_set_channel(channel);
	  nrf24_set_addr_width(5);

	  nrf24_pipe_pld_size(0, pld_size);
	  nrf24_set_crc(en_crc, _1byte);

	  nrf24_auto_retr_delay(0);
	  nrf24_auto_retr_limit(5);

	  nrf24_open_tx_pipe(addr);
	  nrf24_open_rx_pipe(0, addr);

	  nrf24_listen();

	  ce_high();
	  HAL_Delay(5);
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM11)
    {
        if (radio_timeout == 0)
        {
            vx = 0;
            vy = 0;
            vang = 0;
            kicker = 0;
            config = 0;
            param = 0;
        }
        else
        {
            radio_timeout = 0; // Sinal de que rádio está funcionando
        }
    }
}


void acionar_motor(int motor, float dutycycle) {
    TIM_HandleTypeDef *htimA = NULL;
    uint32_t channelA = 0;
    TIM_HandleTypeDef *htimB = NULL;
    uint32_t channelB = 0;

    switch (motor) {
        case 1:
            htimA = &htim1;
            channelA = TIM_CHANNEL_2;
            htimB = &htim1;
            channelB = TIM_CHANNEL_1;
            break;
        case 2:
            htimA = &htim1;
            channelA = TIM_CHANNEL_3;
            htimB = &htim1;
            channelB = TIM_CHANNEL_4;
            break;
        case 3:
            htimA = &htim2;
            channelA = TIM_CHANNEL_3;
            htimB = &htim3;
            channelB = TIM_CHANNEL_4;
            break;
        case 4:
            htimA = &htim2;
            channelA = TIM_CHANNEL_1;
            htimB = &htim3;
            channelB = TIM_CHANNEL_3;
            break;
        default:
            return;
    }

    // Limita dutycycle
    if (dutycycle > 100.0f) dutycycle = 100.0f;
    if (dutycycle < -100.0f) dutycycle = -100.0f;

    uint32_t pwm_value = (uint32_t)((fabsf(dutycycle) / 100.0f) * ARR);

    if (dutycycle > 0) {
        __HAL_TIM_SET_COMPARE(htimA, channelA, pwm_value);
        __HAL_TIM_SET_COMPARE(htimB, channelB, 0);
    } else if (dutycycle < 0) {
        __HAL_TIM_SET_COMPARE(htimA, channelA, 0);
        __HAL_TIM_SET_COMPARE(htimB, channelB, pwm_value);
    } else {
        __HAL_TIM_SET_COMPARE(htimA, channelA, 0);
        __HAL_TIM_SET_COMPARE(htimB, channelB, 0);
    }
}


void soft_start_motor(int motor, float pwm_alvo, float passo) {
    if (pwm_alvo > 100.0f) pwm_alvo = 100.0f;
    if (pwm_alvo < -100.0f) pwm_alvo = -100.0f;

    float* pwm_atual = &duty_cycle_atual[motor - 1];

    if (fabs(*pwm_atual - pwm_alvo) < passo) {
        *pwm_atual = pwm_alvo;
    } else if (*pwm_atual < pwm_alvo) {
        *pwm_atual += passo;
    } else {
        *pwm_atual -= passo;
    }

    acionar_motor(motor, *pwm_atual);
}

