Cerberus-Robotica/Robot_STM32F4/Core/Src/main.c
void gravaFlash(Info *info){
    HAL_FLASH_Unlock();

    // Apaga o setor inteiro
    FLASH_EraseInitTypeDef EraseInitStruct;
    uint32_t SectorError = 0;

    EraseInitStruct.TypeErase     = FLASH_TYPEERASE_SECTORS;
    EraseInitStruct.Sector        = FLASH_USER_SECTOR;
    EraseInitStruct.NbSectors     = 1;
    EraseInitStruct.VoltageRange  = FLASH_VOLTAGE_RANGE_3;

    HAL_FLASHEx_Erase(&EraseInitStruct, &SectorError);

    // Grava palavra por palavra (32 bits)
    uint32_t *data = (uint32_t*)info;
    size_t words = sizeof(Info) / 4;

    for (size_t i = 0; i < words; i++) {
        HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD,
                          FLASH_USER_START_ADDR + i * 4,
                          data[i]);
    }

    HAL_FLASH_Lock();
}

void leFlash(Info *info)
{
    Info *flashCfg = (Info*)FLASH_USER_START_ADDR;
    *info = *flashCfg; // cópia da flash para RAM
}

void act_config(){
	if(config == 1) {
		id = param;
		info.id = param;
		gravaFlash(&info);
	}
	if(config == 5){
		if(param == 0){
			  HAL_Delay(4000);
			  for(int i = 0; i<4; i++){
				  acionar_motor(i+1, 1000);
				  HAL_Delay(1000);
				  acionar_motor(i+1, 0);
				  HAL_Delay(1000);
				  acionar_motor(i+1, -1000);
				  HAL_Delay(1000);
				  acionar_motor(i+1, 0);
			  }
		  }
		  if(param == 1){
			  HAL_Delay(4000);
			  for(int i = 0; i<4; i++){
				  acionar_motor(1, 100);
				  HAL_Delay(1000);
				  acionar_motor(1, 0);
				  acionar_motor(2, 100);
				  HAL_Delay(1000);
				  acionar_motor(2, 0);
				  acionar_motor(3, 100);
				  HAL_Delay(1000);
				  acionar_motor(3, 0);
				  acionar_motor(4, 100);
				  HAL_Delay(1000);
				  acionar_motor(4, 0);
			  }
		  }
		  if(param == 2){
			  for(int i = 0; i<11; i++){
				  acionar_motor(1, i*10);
				  acionar_motor(2, i*10);
				  acionar_motor(3, i*10);
				  acionar_motor(4, i*10);
				  HAL_Delay(2000);
			  }
			  for(int i = 0; i<11; i++){
				  acionar_motor(1, -i*10);
				  acionar_motor(2, -i*10);
				  acionar_motor(3, -i*10);
				  acionar_motor(4, -i*10);
				  HAL_Delay(2000);
			  }
		  }
		  config = 0;
		  param = 0;
	}
}



/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM11_Init();
  MX_TIM3_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);

  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_3);

  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);
  //radio configuration
  radio_setup();
  HAL_TIM_Base_Start_IT(&htim11);

  //Radio variables
  uint8_t rx_buffer[pld_size];
  Pacote pacote_recebido;

  //cinematics variables

  float J[4][3] = {
  	  	    {-sin(a1), cos(a1), R},
  	  	    {-sin(a2), cos(a2), R},
  	  	    {-sin(a3), cos(a3), R},
  	  	    {-sin(a4), cos(a4), R}
  	  	  };
  HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_SET);
  //leFlash(&info);
  info.id = -1;
  if(info.id == 0xFF || info.id > 15 || info.id < -1 || info.id == 0xFF) {
	  Info new_info;
	  new_info.id = -1;
	  //gravaFlash(&new_info);
	  //leFlash(&info);
  }
  id = -1;
  //HAL_UART_Transmit(&huart2, (uint8_t*)"Iniciado!", strlen("Iniciado!"), 100);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0) == GPIO_PIN_RESET) {
		  HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_SET);
		  HAL_Delay(2000);
		  if(id != 0xFF){
			  for (int i = 0; i < id ; i++) {
				  HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_SET);
				  HAL_Delay(1000);
				  HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_RESET);
				  HAL_Delay(1000);
			  }
		  }
		  if (id == -1 || id == 0xFF) {
			  for (int i = 0; i<3; i++) {
				  HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_SET);
				  HAL_Delay(500);
				  HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_RESET);
				  HAL_Delay(500);
			  }
		  }
		  HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_SET);
		  HAL_Delay(2000);
	  }


  // Inicializa pacote com valores padrão
  pacote_recebido.Vx = 0;
  pacote_recebido.Vy = 0;
  pacote_recebido.Vang = 0;
  pacote_recebido.id = -10;
  pacote_recebido.kicker = 0;
  pacote_recebido.config = 0;
  pacote_recebido.param = 0;


  // ---- Comunicação via rádio ----
	if(nrf24_data_available()) {
		nrf24_receive(rx_buffer, pld_size);
		memcpy(&pacote_recebido, rx_buffer, sizeof(Pacote));

		if(pacote_recebido.id == id){
		  // Atualiza variáveis globais
			vx = pacote_recebido.Vx;
			vy = pacote_recebido.Vy;
			vang = pacote_recebido.Vang;
			kicker = pacote_recebido.kicker;
			config = pacote_recebido.config;
			param = pacote_recebido.param;

			radio_timeout = 1;
			HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_RESET);
		} else {
			HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_SET);
			radio_timeout = 0;
		}
	} else {
		radio_timeout = 0;
		HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_SET);
	}
  if (config != 0) {
	  act_config();
	  continue;
  }

  // ---- Cinemática do robô ----
  if (vx > 0.71) vx = 0.71;
  if (vy > 0.71) vy = 0.71;

  float velocidade_angular[4];
  for (int i = 0; i < 4; i++) {
	  velocidade_angular[i] = (1.0f / Rr) * (J[i][0] * vx + J[i][1] * vy + J[i][2] * vang);
  }

